[NoCoverage] Block removal mutation
Pages/Account/Login/Index.cshtml.cs:34:9
         public Index(IInMemoryBus requestDispatcher,
             IIdentityServerInteractionService interactionService,
             IDNTCaptchaValidatorService validatorService) : base(requestDispatcher)
-        {
-            _validatorService = validatorService;
-            _interactionService = interactionService;
-        }
+        {}
 
         #endregion

[NoCoverage] Negate expression
Pages/Account/Login/Index.cshtml.cs:70:17
                 return await LoginFailedAsync();
 
             var loginRespone = await _requestDispatcher.SendQuery(new UserLoginRequest(Input.UserName, Input.Password, Input.RememberLogin));
-            if (loginRespone.IsSuccess)
+            if (!(loginRespone.IsSuccess))
                 return RedirectToReturnUrl(Input.ReturnUrl);
 
