[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Consumers/OwnerProfileUpdatedConsumer.cs:27:17
         {
             var registerUser = new UpdateUserRequest(context.Message.OldEmail, context.Message.NewEmail);
             var result = await _requestDispatcher.SendCommand(registerUser);
-            if (!result.IsSuccess)
+            if (result.IsSuccess)
                 throw new MessageConsumerFaultException(result.Message); // Cause to publish Fault<OwnerProfileUpdated> message
         }
