[Killed] Block removal mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:30:9
         /// 
         /// </summary>
-        {
-            _userManager = userManager;
-            _notifications = notifications;
-        }
+        {}
 
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_not_registered_if_email_is_duplicated; TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed
