[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:22:13
         public static WebApplication ConfigureServices(this WebApplicationBuilder builder)
         {
 
-            builder.AddCustomSerilog();
+            ;
 
             builder.Services.AddRazorPagesPreConfigured();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:24:13
 
             builder.AddCustomSerilog();
 
-            builder.Services.AddRazorPagesPreConfigured();
+            ;
 
             builder.Services.AddModules(builder.Configuration, consumerAssemblyMarkerType:typeof(OwnerRegisteredConsumer));

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:26:13
 
             builder.Services.AddRazorPagesPreConfigured();
 
-            builder.Services.AddModules(builder.Configuration, consumerAssemblyMarkerType:typeof(OwnerRegisteredConsumer));
+            ;
 
             builder.Services.AddIdentityServer();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:28:13
 
             builder.Services.AddModules(builder.Configuration, consumerAssemblyMarkerType:typeof(OwnerRegisteredConsumer));
 
-            builder.Services.AddIdentityServer();
+            ;
             
             builder.Services.AddControllers();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:32:13
             
             builder.Services.AddControllers();
 
-            builder.Services.AddCaptcha();
+            ;
 
             return builder.Build();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:45:13
         public static WebApplication ConfigurePipeline(this WebApplication app)
         {
 
-            app.UseSerilogRequestLogging();
+            ;
 
             app.UseIdentityServer();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:47:13
 
             app.UseSerilogRequestLogging();
 
-            app.UseIdentityServer();
+            ;
 
             app.UseRazorPagesPreConfigured(app.Environment);

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:49:13
 
             app.UseIdentityServer();
 
-            app.UseRazorPagesPreConfigured(app.Environment);
+            ;
 
             app.Services.InitialDatabasesAndSeedEssentialData();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:51:13
 
             app.UseRazorPagesPreConfigured(app.Environment);
 
-            app.Services.InitialDatabasesAndSeedEssentialData();
+            ;
 
             app.MapRazorPages().RequireAuthorization();

[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/HostingExtensions.cs:53:13
 
             app.Services.InitialDatabasesAndSeedEssentialData();
 
-            app.MapRazorPages().RequireAuthorization();
+            ;
 
             app.MapControllers();
