[NoCoverage] Block removal mutation
Pages/Account/Login/Index.cshtml.cs:34:9
         public Index(IInMemoryBus inMemoryBus,
             IIdentityServerInteractionService interactionService,
             IDNTCaptchaValidatorService validatorService) : base(inMemoryBus)
-        {
-            _validatorService = validatorService;
-            _interactionService = interactionService;
-        }
+        {}
 
         #endregion

[NoCoverage] Statement mutation
Pages/Account/Login/Index.cshtml.cs:50:13
         /// </summary>
         public async Task<IActionResult> OnGet(string returnUrl)
         {
-            await BuildModelAsync(returnUrl);
+            ;
 
             return Page();

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Pages/Account/Login/Index.cshtml.cs:63:17
 
         public async Task<IActionResult> OnPost()
         {
-            if (!_validatorService.HasRequestValidCaptchaEntry(Language.English, DisplayMode.SumOfTwoNumbers))
+            if (_validatorService.HasRequestValidCaptchaEntry(Language.English, DisplayMode.SumOfTwoNumbers))
                 ModelState.AddModelError("", ApplicationMessages.Captcha_Is_Not_Valid);
 

[NoCoverage] Statement mutation
Pages/Account/Login/Index.cshtml.cs:64:17
         public async Task<IActionResult> OnPost()
         {
             if (!_validatorService.HasRequestValidCaptchaEntry(Language.English, DisplayMode.SumOfTwoNumbers))
-                ModelState.AddModelError("", ApplicationMessages.Captcha_Is_Not_Valid);
+                ;
 
             if (!ModelState.IsValid)

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Pages/Account/Login/Index.cshtml.cs:66:17
             if (!_validatorService.HasRequestValidCaptchaEntry(Language.English, DisplayMode.SumOfTwoNumbers))
                 ModelState.AddModelError("", ApplicationMessages.Captcha_Is_Not_Valid);
 
-            if (!ModelState.IsValid)
+            if (ModelState.IsValid)
                 return await LoginFailedAsync();
 

[NoCoverage] Negate expression
Pages/Account/Login/Index.cshtml.cs:70:17
                 return await LoginFailedAsync();
 
             var loginRespone = await _inMemoryBus.SendQuery(new UserLoginRequest(Input.UserName, Input.Password, Input.RememberLogin));
-            if (loginRespone.IsSuccess)
+            if (!(loginRespone.IsSuccess))
                 return RedirectToReturnUrl(Input.ReturnUrl);
 

[NoCoverage] Statement mutation
Pages/Account/Login/Index.cshtml.cs:90:13
         /// </summary>
         private async Task<IActionResult> LoginFailedAsync(IEnumerable<string> errors = null)
         {
-            await BuildModelAsync(Input.ReturnUrl);
+            ;
 
             foreach (var error in errors ?? Enumerable.Empty<string>())

[NoCoverage] Null coalescing mutation (left to right)
Pages/Account/Login/Index.cshtml.cs:92:35
         {
             await BuildModelAsync(Input.ReturnUrl);
 
-            foreach (var error in errors ?? Enumerable.Empty<string>())
+            foreach (var error in Enumerable.Empty<string>() ?? errors)
                 ModelState.AddModelError(string.Empty, error);
 

[NoCoverage] Null coalescing mutation (remove left)
Pages/Account/Login/Index.cshtml.cs:92:35
         {
             await BuildModelAsync(Input.ReturnUrl);
 
-            foreach (var error in errors ?? Enumerable.Empty<string>())
+            foreach (var error in errors)
                 ModelState.AddModelError(string.Empty, error);
 

[NoCoverage] Statement mutation
Pages/Account/Login/Index.cshtml.cs:93:17
             await BuildModelAsync(Input.ReturnUrl);
 
             foreach (var error in errors ?? Enumerable.Empty<string>())
-                ModelState.AddModelError(string.Empty, error);
+                ;
 
             return Page();

[NoCoverage] String mutation
Pages/Account/Login/Index.cshtml.cs:108:22
         private async Task BuildModelAsync(string returnUrl)
         {
             var context = await _interactionService.GetAuthorizationContextAsync(returnUrl);
-            ViewData["ClientUri"] = context?.Client.ClientUri;
+            ViewData[""] = context?.Client.ClientUri;
 
             Input = new InputModel

[NoCoverage] Null coalescing mutation (remove left)
Pages/Account/Login/Index.cshtml.cs:120:29
 
         private IActionResult RedirectToReturnUrl(string returnUrl)
         {
-            return Redirect(returnUrl ?? "/");
+            return Redirect(returnUrl);
         }
 

[NoCoverage] Null coalescing mutation (left to right)
Pages/Account/Login/Index.cshtml.cs:120:29
 
         private IActionResult RedirectToReturnUrl(string returnUrl)
         {
-            return Redirect(returnUrl ?? "/");
+            return Redirect("/" ?? returnUrl);
         }
 
