[NoCoverage] Block removal mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:30:9
         /// 
         /// </summary>
         public UpdateUserUseCase(UserManager<User> userManager, IMessageBus eventPublisher, IInMemoryBus requestDispatcher, INotificationHandler notifications) : base(eventPublisher,requestDispatcher)
-        {
-            _userManager = userManager;
-            _notifications = notifications;
-        }
+        {}
 
 
