[NoCoverage] Block removal mutation
Pages/Account/Logout/Index.cshtml.cs:28:9
         public string LogoutId { get; set; }
 
         public Index(SignInManager<User> signInManager, IIdentityServerInteractionService interaction, IEventService events)
-        {
-            _signInManager = signInManager;
-            _interaction = interaction;
-            _events = events;
-        }
+        {}
 
         public async Task<IActionResult> OnGet(string logoutId)

[NoCoverage] Block removal mutation
Pages/Account/Logout/Index.cshtml.cs:35:9
         }
 
         public async Task<IActionResult> OnGet(string logoutId)
-        {
-            LogoutId = logoutId;
-
-            return await OnPost();
-        }
+        {}
 
         public async Task<IActionResult> OnPost()

[NoCoverage] Boolean mutation
Pages/Account/Logout/Index.cshtml.cs:43:51
 
         public async Task<IActionResult> OnPost()
         {
-            if (User?.Identity.IsAuthenticated == true)
+            if (User?.Identity.IsAuthenticated == false)
             {
                 // if there's no current logout context, we need to create one

[NoCoverage] Equality mutation
Pages/Account/Logout/Index.cshtml.cs:43:17
 
         public async Task<IActionResult> OnPost()
         {
-            if (User?.Identity.IsAuthenticated == true)
+            if (User?.Identity.IsAuthenticated != true)
             {
                 // if there's no current logout context, we need to create one

[NoCoverage] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Pages/Account/Logout/Index.cshtml.cs:48:17
                 // if there's no current logout context, we need to create one
                 // this captures necessary info from the current logged in user
                 // this can still return null if there is no context needed
-                LogoutId ??= await _interaction.CreateLogoutContextAsync();
+                LogoutId = await _interaction.CreateLogoutContextAsync();
 
                 // delete local authentication cookie

[NoCoverage] Statement mutation
Pages/Account/Logout/Index.cshtml.cs:51:17
                 LogoutId ??= await _interaction.CreateLogoutContextAsync();
 
                 // delete local authentication cookie
-                await _signInManager.SignOutAsync();
+                ;
 
                 // raise the logout event

[NoCoverage] Statement mutation
Pages/Account/Logout/Index.cshtml.cs:54:17
                 await _signInManager.SignOutAsync();
 
                 // raise the logout event
-                await _events.RaiseAsync(new UserLogoutSuccessEvent(User.GetSubjectId(), User.GetDisplayName()));
+                ;
 
                 // see if we need to trigger federated logout

[NoCoverage] Logical mutation
Pages/Account/Logout/Index.cshtml.cs:60:21
                 var idp = User.FindFirst(JwtClaimTypes.IdentityProvider)?.Value;
 
                 // if it's a local login we can ignore this workflow
-                if (idp != null && idp != Duende.IdentityServer.IdentityServerConstants.LocalIdentityProvider)
+                if (idp != null || idp != Duende.IdentityServer.IdentityServerConstants.LocalIdentityProvider)
                 {
                     // we need to see if the provider supports external logout

[NoCoverage] Equality mutation
Pages/Account/Logout/Index.cshtml.cs:60:21
                 var idp = User.FindFirst(JwtClaimTypes.IdentityProvider)?.Value;
 
                 // if it's a local login we can ignore this workflow
-                if (idp != null && idp != Duende.IdentityServer.IdentityServerConstants.LocalIdentityProvider)
+                if (idp == null && idp != Duende.IdentityServer.IdentityServerConstants.LocalIdentityProvider)
                 {
                     // we need to see if the provider supports external logout

[NoCoverage] Negate expression
Pages/Account/Logout/Index.cshtml.cs:63:25
                 if (idp != null && idp != Duende.IdentityServer.IdentityServerConstants.LocalIdentityProvider)
                 {
                     // we need to see if the provider supports external logout
-                    if (await HttpContext.GetSchemeSupportsSignOut(idp))
+                    if (!(await HttpContext.GetSchemeSupportsSignOut(idp)))
                     {
                         // build a return URL so the upstream provider will redirect back
