[NoCoverage] Array initializer mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:14:74
         /// <summary>
         /// 
         /// </summary>
-        public static IEnumerable<IdentityResource> IdentityResources => new IdentityResource[]
-        {
-            new IdentityResources.OpenId(),
-            new IdentityResources.Profile(),
-        };
+        public static IEnumerable<IdentityResource> IdentityResources => new IdentityResource[]
+{};
 
 

[NoCoverage] Array initializer mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:25:58
         /// <summary>
         /// 
         /// </summary>
-        public static IEnumerable<ApiScope> ApiScopes => new ApiScope[]
-        {
-           ApiScopesConfig.Owners_Read,
-           ApiScopesConfig.Owners_Write,
-           ApiScopesConfig.Boards_Read,
-           ApiScopesConfig.Boards_Write,
-           ApiScopesConfig.Tasks_Read,
-           ApiScopesConfig.Tasks_Write,
-        };
+        public static IEnumerable<ApiScope> ApiScopes => new ApiScope[]
+{};
 
 

[NoCoverage] Array initializer mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:40:64
         /// <summary>
         /// 
         /// </summary>
-        public static IEnumerable<ApiResource> ApiResources => new ApiResource[]
-        {
-           ApiResourcesConfig.Owners_Api,
-           ApiResourcesConfig.Boards_Api,
-           ApiResourcesConfig.Tasks_Api,
-           ApiResourcesConfig.Aggregator_Api
-        };
+        public static IEnumerable<ApiResource> ApiResources => new ApiResource[]
+{};
 
 

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:102:27
         {
             ClientId = "UserPanel",
             AllowedGrantTypes = GrantTypes.Code,
-            RequirePkce = true,
+            RequirePkce = false,
             RequireClientSecret = false,
             AllowedCorsOrigins = { "https://localhost:5011" },

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:103:35
             ClientId = "UserPanel",
             AllowedGrantTypes = GrantTypes.Code,
             RequirePkce = true,
-            RequireClientSecret = false,
+            RequireClientSecret = true,
             AllowedCorsOrigins = { "https://localhost:5011" },
             AllowedScopes =

[NoCoverage] String mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:132:87
     {
 
         public static ApiScope Owners_Read => new(name: "owners.read", displayName: "Owners Read APIs");
-        public static ApiScope Owners_Write => new(name: "owners.write", displayName: "Owners Write APIs");
+        public static ApiScope Owners_Write => new(name: "owners.write", displayName: "");
 
 

[NoCoverage] String mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:135:85
         public static ApiScope Owners_Write => new(name: "owners.write", displayName: "Owners Write APIs");
 
 
-        public static ApiScope Boards_Read => new(name: "boards.read", displayName: "Boards Read APIs");
+        public static ApiScope Boards_Read => new(name: "boards.read", displayName: "");
         public static ApiScope Boards_Write => new(name: "boards.write", displayName: "Boards Write APIs");
 

[NoCoverage] String mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:136:58
 
 
         public static ApiScope Boards_Read => new(name: "boards.read", displayName: "Boards Read APIs");
-        public static ApiScope Boards_Write => new(name: "boards.write", displayName: "Boards Write APIs");
+        public static ApiScope Boards_Write => new(name: "", displayName: "Boards Write APIs");
 
 

[NoCoverage] String mutation
Api/Identity.Api/Configuration/IdentityServerConfig.cs:140:57
 
 
         public static ApiScope Tasks_Read => new(name: "tasks.read", displayName: "Tasks Read APIs");
-        public static ApiScope Tasks_Write => new(name: "tasks.write", displayName: "Tasks Write APIs");
+        public static ApiScope Tasks_Write => new(name: "", displayName: "Tasks Write APIs");
     }
 
