[NoCoverage] Block removal mutation
Pages/Account/Logout/LoggedOut.cshtml.cs:17:9
 
 
         public LoggedOut(IIdentityServerInteractionService interactionService)
-        {
-            _interactionService = interactionService;
-        }
+        {}
 
         public async Task<IActionResult> OnGet(string logoutId)

[NoCoverage] Null coalescing mutation (remove right)
Pages/Account/Logout/LoggedOut.cshtml.cs:27:29
             var logout = await _interactionService.GetLogoutContextAsync(logoutId);
             var postLogoutRedirectUri = logout?.PostLogoutRedirectUri;
 
-            return Redirect(postLogoutRedirectUri??"/");
+            return Redirect("/");
         }
     }

[NoCoverage] Null coalescing mutation (remove left)
Pages/Account/Logout/LoggedOut.cshtml.cs:27:29
             var logout = await _interactionService.GetLogoutContextAsync(logoutId);
             var postLogoutRedirectUri = logout?.PostLogoutRedirectUri;
 
-            return Redirect(postLogoutRedirectUri??"/");
+            return Redirect(postLogoutRedirectUri);
         }
     }
