[NoCoverage] Statement mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:17:13
         /// </summary>
         public static void AddIdentityServer(this IServiceCollection services )
         {
-            services.AddIdentityServer(options =>
-                {
-                    options.Events.RaiseErrorEvents = true;
-                    options.Events.RaiseInformationEvents = true;
-                    options.Events.RaiseFailureEvents = true;
-                    options.Events.RaiseSuccessEvents = true;
-
-                    // see https://docs.duendesoftware.com/identityserver/v6/fundamentals/resources/
-                    options.EmitStaticAudienceClaim = true;
-                })
-                .AddInMemoryIdentityResources(IdentityServerConfig.IdentityResources)
-                .AddInMemoryApiScopes(IdentityServerConfig.ApiScopes)
-                .AddInMemoryApiResources(IdentityServerConfig.ApiResources)
-                .AddInMemoryClients(IdentityServerConfig.Clients)
-                .AddAspNetIdentity<User>();
+            ;
         }
 

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:19:55
         {
             services.AddIdentityServer(options =>
                 {
-                    options.Events.RaiseErrorEvents = true;
+                    options.Events.RaiseErrorEvents = false;
                     options.Events.RaiseInformationEvents = true;
                     options.Events.RaiseFailureEvents = true;

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:20:61
             services.AddIdentityServer(options =>
                 {
                     options.Events.RaiseErrorEvents = true;
-                    options.Events.RaiseInformationEvents = true;
+                    options.Events.RaiseInformationEvents = false;
                     options.Events.RaiseFailureEvents = true;
                     options.Events.RaiseSuccessEvents = true;

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:21:57
                 {
                     options.Events.RaiseErrorEvents = true;
                     options.Events.RaiseInformationEvents = true;
-                    options.Events.RaiseFailureEvents = true;
+                    options.Events.RaiseFailureEvents = false;
                     options.Events.RaiseSuccessEvents = true;
 

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:22:57
                     options.Events.RaiseErrorEvents = true;
                     options.Events.RaiseInformationEvents = true;
                     options.Events.RaiseFailureEvents = true;
-                    options.Events.RaiseSuccessEvents = true;
+                    options.Events.RaiseSuccessEvents = false;
 
                     // see https://docs.duendesoftware.com/identityserver/v6/fundamentals/resources/

[NoCoverage] Boolean mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:25:55
                     options.Events.RaiseSuccessEvents = true;
 
                     // see https://docs.duendesoftware.com/identityserver/v6/fundamentals/resources/
-                    options.EmitStaticAudienceClaim = true;
+                    options.EmitStaticAudienceClaim = false;
                 })
                 .AddInMemoryIdentityResources(IdentityServerConfig.IdentityResources)

[NoCoverage] Block removal mutation
Api/Identity.Api/Configuration/IdentityServerExtensions.cs:40:9
         /// Determines if the authentication scheme support signout.
         /// </summary>
         public static async Task<bool> GetSchemeSupportsSignOut(this HttpContext context, string scheme)
-        {
-            var provider = context.RequestServices.GetRequiredService<IAuthenticationHandlerProvider>();
-            var handler = await provider.GetHandlerAsync(context, scheme);
-            return (handler is IAuthenticationSignOutHandler);
-        }
+        {}
     }
 }
