[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Consumers/OwnerProfileUpdatedConsumer.cs:27:17
         {
             var registerUser = new UpdateUserRequest(context.Message.OldEmail, context.Message.NewEmail);
             var result = await _inMemoryBus.SendCommand(registerUser);
-            if (!result.IsSuccess)
+            if (result.IsSuccess)
                 throw new MessageConsumerFaultException(result.Message); // Cause to publish Fault<OwnerProfileUpdated> message
         }

[NoCoverage] Statement mutation
Api/Identity.Api/Consumers/OwnerProfileUpdatedConsumer.cs:28:17
             var registerUser = new UpdateUserRequest(context.Message.OldEmail, context.Message.NewEmail);
             var result = await _inMemoryBus.SendCommand(registerUser);
             if (!result.IsSuccess)
-                throw new MessageConsumerFaultException(result.Message); // Cause to publish Fault<OwnerProfileUpdated> message
+                ; // Cause to publish Fault<OwnerProfileUpdated> message
         }
     }
