[NoCoverage] Negate expression
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:15:17
         public override void OnResultExecuting(ResultExecutingContext context)
         {
             var result = context.Result;
-            if (result is PageResult)
+            if (!(result is PageResult))
             {
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:18:21
             if (result is PageResult)
             {
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options
-                if (!context.HttpContext.Response.Headers.ContainsKey("X-Content-Type-Options"))
+                if (context.HttpContext.Response.Headers.ContainsKey("X-Content-Type-Options"))
                 {
                     context.HttpContext.Response.Headers.Add("X-Content-Type-Options", "nosniff");

[NoCoverage] String mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:18:71
             if (result is PageResult)
             {
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options
-                if (!context.HttpContext.Response.Headers.ContainsKey("X-Content-Type-Options"))
+                if (!context.HttpContext.Response.Headers.ContainsKey(""))
                 {
                     context.HttpContext.Response.Headers.Add("X-Content-Type-Options", "nosniff");

[NoCoverage] Statement mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:20:21
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options
                 if (!context.HttpContext.Response.Headers.ContainsKey("X-Content-Type-Options"))
                 {
-                    context.HttpContext.Response.Headers.Add("X-Content-Type-Options", "nosniff");
+                    ;
                 }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:24:21
                 }
 
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
-                if (!context.HttpContext.Response.Headers.ContainsKey("X-Frame-Options"))
+                if (context.HttpContext.Response.Headers.ContainsKey("X-Frame-Options"))
                 {
                     context.HttpContext.Response.Headers.Add("X-Frame-Options", "SAMEORIGIN");

[NoCoverage] String mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:24:71
                 }
 
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
-                if (!context.HttpContext.Response.Headers.ContainsKey("X-Frame-Options"))
+                if (!context.HttpContext.Response.Headers.ContainsKey(""))
                 {
                     context.HttpContext.Response.Headers.Add("X-Frame-Options", "SAMEORIGIN");

[NoCoverage] Statement mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:26:21
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
                 if (!context.HttpContext.Response.Headers.ContainsKey("X-Frame-Options"))
                 {
-                    context.HttpContext.Response.Headers.Add("X-Frame-Options", "SAMEORIGIN");
+                    ;
                 }
 

[NoCoverage] String mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:26:62
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
                 if (!context.HttpContext.Response.Headers.ContainsKey("X-Frame-Options"))
                 {
-                    context.HttpContext.Response.Headers.Add("X-Frame-Options", "SAMEORIGIN");
+                    context.HttpContext.Response.Headers.Add("", "SAMEORIGIN");
                 }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:37:21
                 // csp += "img-src 'self' https://pbs.twimg.com;";
 
                 // once for standards compliant browsers
-                if (!context.HttpContext.Response.Headers.ContainsKey("Content-Security-Policy"))
+                if (context.HttpContext.Response.Headers.ContainsKey("Content-Security-Policy"))
                 {
                     context.HttpContext.Response.Headers.Add("Content-Security-Policy", csp);

[NoCoverage] Statement mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:39:21
                 // once for standards compliant browsers
                 if (!context.HttpContext.Response.Headers.ContainsKey("Content-Security-Policy"))
                 {
-                    context.HttpContext.Response.Headers.Add("Content-Security-Policy", csp);
+                    ;
                 }
                 // and once again for IE

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:42:21
                     context.HttpContext.Response.Headers.Add("Content-Security-Policy", csp);
                 }
                 // and once again for IE
-                if (!context.HttpContext.Response.Headers.ContainsKey("X-Content-Security-Policy"))
+                if (context.HttpContext.Response.Headers.ContainsKey("X-Content-Security-Policy"))
                 {
                     context.HttpContext.Response.Headers.Add("X-Content-Security-Policy", csp);

[NoCoverage] Statement mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:44:21
                 // and once again for IE
                 if (!context.HttpContext.Response.Headers.ContainsKey("X-Content-Security-Policy"))
                 {
-                    context.HttpContext.Response.Headers.Add("X-Content-Security-Policy", csp);
+                    ;
                 }
 

[NoCoverage] String mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:44:62
                 // and once again for IE
                 if (!context.HttpContext.Response.Headers.ContainsKey("X-Content-Security-Policy"))
                 {
-                    context.HttpContext.Response.Headers.Add("X-Content-Security-Policy", csp);
+                    context.HttpContext.Response.Headers.Add("", csp);
                 }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:49:21
 
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Referrer-Policy
                 var referrer_policy = "no-referrer";
-                if (!context.HttpContext.Response.Headers.ContainsKey("Referrer-Policy"))
+                if (context.HttpContext.Response.Headers.ContainsKey("Referrer-Policy"))
                 {
                     context.HttpContext.Response.Headers.Add("Referrer-Policy", referrer_policy);

[NoCoverage] String mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:49:71
 
                 // https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Referrer-Policy
                 var referrer_policy = "no-referrer";
-                if (!context.HttpContext.Response.Headers.ContainsKey("Referrer-Policy"))
+                if (!context.HttpContext.Response.Headers.ContainsKey(""))
                 {
                     context.HttpContext.Response.Headers.Add("Referrer-Policy", referrer_policy);

[NoCoverage] Statement mutation
Api/Identity.Api/Pages/SecurityHeadersAttribute.cs:51:21
                 var referrer_policy = "no-referrer";
                 if (!context.HttpContext.Response.Headers.ContainsKey("Referrer-Policy"))
                 {
-                    context.HttpContext.Response.Headers.Add("Referrer-Policy", referrer_policy);
+                    ;
                 }
             }
