[NoCoverage] Statement mutation
Api/Identity.Api/Consumers/OwnerRegisteredConsumer.cs:28:17
             var registerUser = new RegisterUserRequest(context.Message.Id, context.Message.Email, context.Message.Password);
             var result = await _inMemoryBus.SendCommand(registerUser);
             if (!result.IsSuccess)
-                throw new MessageConsumerFaultException(result.Message); // Cause to publish Fault<OwnerRegistered> message
+                ; // Cause to publish Fault<OwnerRegistered> message
         }
     }
