[Killed] Block removal mutation
Identity.Api/UseCases/UserLogin/UserLoginRequest.cs:11:9
     public class UserLoginRequest : BaseQuery<Result>
     {
         public UserLoginRequest(string userName, string password, bool rememberLogin)
-        {
-            UserName = userName;
-            Password = password;
-            RememberLogin = rememberLogin;
-        }
+        {}
 
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_logged_in; TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.Deactive_user_is_not_logged_in
statusReason: Non-CSharp files in test project were changed
