[Survived] Block removal mutation
Identity.Api/Domain/Entities/User.cs:8:9
    public class User : IdentityUser<string>
     {
         public User(string id)
-        {
-            Id= id;
-        }
+        {}
 
         public bool IsActive { get; set; }
