[Killed] Block removal mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:22:9
 
 
         public UserLoginUseCase(UserManager<User> userManager, SignInManager<User> signInManager, IMapper mapper) : base(mapper)
-        {
-            _userManager = userManager;
-            _signInManager = signInManager;
-        }
+        {}
 
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_logged_in; TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_not_logged_in_with_wrong_password; TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.Deactive_user_is_not_logged_in
statusReason: Non-CSharp files in test project were changed

[Survived] Boolean mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:30:149
 
         public async Task<Result> Handle(UserLoginRequest request, CancellationToken cancellationToken)
         {
-            var signInAsync = await _signInManager.PasswordSignInAsync(request.UserName, request.Password, request.RememberLogin, lockoutOnFailure: true);
+            var signInAsync = await _signInManager.PasswordSignInAsync(request.UserName, request.Password, request.RememberLogin, lockoutOnFailure: false);
             if (!signInAsync.Succeeded)
                 throw new ApplicationException(ApplicationMessages.Invalid_Credentials);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:31:17
         public async Task<Result> Handle(UserLoginRequest request, CancellationToken cancellationToken)
         {
             var signInAsync = await _signInManager.PasswordSignInAsync(request.UserName, request.Password, request.RememberLogin, lockoutOnFailure: true);
-            if (!signInAsync.Succeeded)
+            if (signInAsync.Succeeded)
                 throw new ApplicationException(ApplicationMessages.Invalid_Credentials);
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_logged_in; TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_not_logged_in_with_wrong_password; TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.Deactive_user_is_not_logged_in
statusReason: Non-CSharp files in test project were changed

[Killed] Statement mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:32:17
         {
             var signInAsync = await _signInManager.PasswordSignInAsync(request.UserName, request.Password, request.RememberLogin, lockoutOnFailure: true);
             if (!signInAsync.Succeeded)
-                throw new ApplicationException(ApplicationMessages.Invalid_Credentials);
+                ;
 
             var user = await _userManager.FindByNameAsync(request.UserName);
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_not_logged_in_with_wrong_password
statusReason: Non-CSharp files in test project were changed

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:35:17
                 throw new ApplicationException(ApplicationMessages.Invalid_Credentials);
 
             var user = await _userManager.FindByNameAsync(request.UserName);
-            if (!user.IsActive)
+            if (user.IsActive)
                 throw new ApplicationException(ApplicationMessages.Deactive_User_Can_Not_Login);
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_logged_in; TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.Deactive_user_is_not_logged_in
statusReason: Non-CSharp files in test project were changed

[Killed] Statement mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:36:17
 
             var user = await _userManager.FindByNameAsync(request.UserName);
             if (!user.IsActive)
-                throw new ApplicationException(ApplicationMessages.Deactive_User_Can_Not_Login);
+                ;
 
             await _userManager.AddLoginAsync(user, new UserLoginInfo("local", "local", "local"));
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.Deactive_user_is_not_logged_in
statusReason: Non-CSharp files in test project were changed

[Killed] Statement mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:38:13
             if (!user.IsActive)
                 throw new ApplicationException(ApplicationMessages.Deactive_User_Can_Not_Login);
 
-            await _userManager.AddLoginAsync(user, new UserLoginInfo("local", "local", "local"));
+            ;
 
             return Result.Success(ContractsMessages.Operation_Success);
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.UserLoginTests.User_is_logged_in
statusReason: Non-CSharp files in test project were changed

[Survived] String mutation
Identity.Api/UseCases/UserLogin/UserLoginUseCase.cs:38:70
             if (!user.IsActive)
                 throw new ApplicationException(ApplicationMessages.Deactive_User_Can_Not_Login);
 
-            await _userManager.AddLoginAsync(user, new UserLoginInfo("local", "local", "local"));
+            await _userManager.AddLoginAsync(user, new UserLoginInfo("", "local", "local"));
 
             return Result.Success(ContractsMessages.Operation_Success);
