[Survived] Block removal mutation
Identity.Api/Domain/Events/UserRegisteredEvent.cs:9:9
     public class UserRegisteredEvent : DomainEvent
     {
         public UserRegisteredEvent(string id, string email) : base(entityId: id, entityType: DomainMetadata.User)
-        {
-            Id = id;
-            Email = email;
-        }
+        {}
 
 
