[NoCoverage] Block removal mutation
Identity.Api/Domain/Events/UserUpdatedEvent.cs:9:9
     public class UserUpdatedEvent : DomainEvent
     {
         public UserUpdatedEvent(string id, string email) : base(entityId: id, entityType: DomainMetadata.User)
-        {
-            Id = id;
-            Email = email;
-        }
+        {}
 
 
