[NoCoverage] Statement mutation
Infrastructure/CrossCutting/AspNetIdentity/AspNetIdentityExtensions.cs:17:13
         /// </summary>
         public static void AddAspNetIdentity(this IServiceCollection services, IConfiguration configuration)
         {
-            services.AddIdentity<User, IdentityRole<string>>()
-                .AddEntityFrameworkStores<IdentityDbContext>()
-                .AddDefaultTokenProviders();
+            ;
 
             services.Configure<IdentityOptions>(options =>

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/AspNetIdentity/AspNetIdentityExtensions.cs:21:13
                 .AddEntityFrameworkStores<IdentityDbContext>()
                 .AddDefaultTokenProviders();
 
-            services.Configure<IdentityOptions>(options =>
-            {
-                configuration.GetSection("Identity:Options").Bind(options);
-            });
+            ;
         }
     }

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/AspNetIdentity/AspNetIdentityExtensions.cs:23:17
 
             services.Configure<IdentityOptions>(options =>
             {
-                configuration.GetSection("Identity:Options").Bind(options);
+                ;
             });
         }

[NoCoverage] String mutation
Infrastructure/CrossCutting/AspNetIdentity/AspNetIdentityExtensions.cs:23:42
 
             services.Configure<IdentityOptions>(options =>
             {
-                configuration.GetSection("Identity:Options").Bind(options);
+                configuration.GetSection("").Bind(options);
             });
         }
