[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/ApplicationModule.cs:20:13
         /// </summary>
         public static void AddApplicationModule(this IServiceCollection services)
         {
-            services.AddBuildingBlocksApplication(typeof(UpdateUserValidation<>));
+            ;
         }
 
