[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:26:13
         /// </summary>
         public static void AddInfrastructureModule(this IServiceCollection services, IConfiguration configuration,Type consumerAssemblyMarkerType)
         {
-            services.AddBuildingBlocksInfrastructure(configuration,consumerAssemblyMarkerType, handlerAssemblyMarkerType:typeof(RegisterUserUseCase));
+            ;
 
             services.AddMapper(typeof(MappingProfile));

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:28:13
         {
             services.AddBuildingBlocksInfrastructure(configuration,consumerAssemblyMarkerType, handlerAssemblyMarkerType:typeof(RegisterUserUseCase));
 
-            services.AddMapper(typeof(MappingProfile));
+            ;
 
             services.AddDbContext();

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:30:13
 
             services.AddMapper(typeof(MappingProfile));
 
-            services.AddDbContext();
+            ;
 
             services.AddAspNetIdentity(configuration);

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:32:13
 
             services.AddDbContext();
 
-            services.AddAspNetIdentity(configuration);
+            ;
         }
 

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:42:13
         /// </summary>
         public static void AddDbContext(this IServiceCollection services)
         {
-            services.AddDbContext<IdentityDbContext>();
+            ;
         }
 

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:52:13
         /// </summary>
         public static void InitialDatabasesAndSeedEssentialData(this IServiceProvider serviceProvider)
         {
-            serviceProvider.InitialDatabase();
+            ;
             serviceProvider.SeedEssentialData();
         }

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/InfrastructureModule.cs:53:13
         public static void InitialDatabasesAndSeedEssentialData(this IServiceProvider serviceProvider)
         {
             serviceProvider.InitialDatabase();
-            serviceProvider.SeedEssentialData();
+            ;
         }
 
