[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/ModuleExtensions.cs:21:13
         /// </summary>
         public static void AddModules(this IServiceCollection services, IConfiguration configuration, Type consumerAssemblyMarkerType)
         {
-            services.AddInfrastructureModule(configuration, consumerAssemblyMarkerType);
+            ;
 
             services.AddApplicationModule();

[NoCoverage] Statement mutation
Infrastructure/CrossCutting/DI/ModuleExtensions.cs:23:13
         {
             services.AddInfrastructureModule(configuration, consumerAssemblyMarkerType);
 
-            services.AddApplicationModule();
+            ;
         }
     }
