[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/DbInitialization.cs:27:13
 
             var dbContext = serviceScope.ServiceProvider.GetService<IdentityDbContext>();
 
-            dbContext.Database.EnsureCreated();
+            ;
         }
 

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/DbInitialization.cs:41:13
             var configuration = serviceScope.ServiceProvider.GetService<IConfiguration>();
             var userManager = serviceScope.ServiceProvider.GetService<UserManager<User>>();
 
-            SeedSuperUser(userManager, configuration).Wait();
+            ;
         }
 

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/DbInitialization.cs:55:13
 
             var dbContext = serviceScope.ServiceProvider.GetService<IdentityDbContext>();
 
-            dbContext.Database.EnsureDeleted();
+            ;
         }
 

[NoCoverage] String mutation
Infrastructure/Data/DbContext/DbInitialization.cs:64:48
         /// </summary>
         private async static Task SeedSuperUser(UserManager<User> userManager, IConfiguration configuration)
         {
-            var superUserEmail = configuration["Identity:SuperUser:Email"];
+            var superUserEmail = configuration[""];
             var superUserName = configuration["Identity:SuperUser:UserName"];
 

[NoCoverage] String mutation
Infrastructure/Data/DbContext/DbInitialization.cs:65:47
         private async static Task SeedSuperUser(UserManager<User> userManager, IConfiguration configuration)
         {
             var superUserEmail = configuration["Identity:SuperUser:Email"];
-            var superUserName = configuration["Identity:SuperUser:UserName"];
+            var superUserName = configuration[""];
 
             if (await userManager.FindByEmailAsync(superUserEmail) == null)

[NoCoverage] Equality mutation
Infrastructure/Data/DbContext/DbInitialization.cs:67:17
             var superUserEmail = configuration["Identity:SuperUser:Email"];
             var superUserName = configuration["Identity:SuperUser:UserName"];
 
-            if (await userManager.FindByEmailAsync(superUserEmail) == null)
+            if (await userManager.FindByEmailAsync(superUserEmail) != null)
             {
                 var superUser = new User(Guid.NewGuid().ToString())

[NoCoverage] Object initializer mutation
Infrastructure/Data/DbContext/DbInitialization.cs:69:33
 
             if (await userManager.FindByEmailAsync(superUserEmail) == null)
             {
-                var superUser = new User(Guid.NewGuid().ToString())
-                {
-                    UserName = superUserName,
-                    Email = superUserEmail,
-                    IsActive = true,
-                };
+                var superUser = new User(Guid.NewGuid().ToString())
+{};
 
                 var password = configuration["Identity:SuperUser:Password"];

[NoCoverage] Boolean mutation
Infrastructure/Data/DbContext/DbInitialization.cs:73:32
                 {
                     UserName = superUserName,
                     Email = superUserEmail,
-                    IsActive = true,
+                    IsActive = false,
                 };
 

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/DbInitialization.cs:77:17
                 };
 
                 var password = configuration["Identity:SuperUser:Password"];
-                await userManager.CreateAsync(superUser, password);
+                ;
             }
         }
