[NoCoverage] Block removal mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:14:9
         private readonly IConfiguration _configuration;
 
         public IdentityDbContext(IConfiguration configuration)
-        {
-            _configuration = configuration;
-        }
+        {}
 
 

[NoCoverage] String mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:24:62
         /// </summary>
         protected override void OnConfiguring(DbContextOptionsBuilder optionsBuilder)
         {
-            var connection = _configuration.GetValue<string>("SQL:Connection");
+            var connection = _configuration.GetValue<string>("");
             var databaseName = _configuration.GetValue<string>("SQL:DatabaseName");
 

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:27:13
             var connection = _configuration.GetValue<string>("SQL:Connection");
             var databaseName = _configuration.GetValue<string>("SQL:DatabaseName");
 
-            optionsBuilder.UseSqlServer(connection.Replace("[DatabaseName]", databaseName));
+            ;
         }
 

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:37:13
         /// </summary>
         protected override void OnModelCreating(ModelBuilder builder)
         {
-            base.OnModelCreating(builder);
+            ;
 
             builder.Entity<User>().ToTable("Users");

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:39:13
         {
             base.OnModelCreating(builder);
 
-            builder.Entity<User>().ToTable("Users");
+            ;
             builder.Entity<IdentityRole<string>>().ToTable("Roles");
             builder.Entity<UserToken>().ToTable("UserTokens");

[NoCoverage] String mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:39:44
         {
             base.OnModelCreating(builder);
 
-            builder.Entity<User>().ToTable("Users");
+            builder.Entity<User>().ToTable("");
             builder.Entity<IdentityRole<string>>().ToTable("Roles");
             builder.Entity<UserToken>().ToTable("UserTokens");

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:40:13
             base.OnModelCreating(builder);
 
             builder.Entity<User>().ToTable("Users");
-            builder.Entity<IdentityRole<string>>().ToTable("Roles");
+            ;
             builder.Entity<UserToken>().ToTable("UserTokens");
             builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:41:13
 
             builder.Entity<User>().ToTable("Users");
             builder.Entity<IdentityRole<string>>().ToTable("Roles");
-            builder.Entity<UserToken>().ToTable("UserTokens");
+            ;
             builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");
             builder.Entity<IdentityRoleClaim<string>>().ToTable("RoleClaims");

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:42:13
             builder.Entity<User>().ToTable("Users");
             builder.Entity<IdentityRole<string>>().ToTable("Roles");
             builder.Entity<UserToken>().ToTable("UserTokens");
-            builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");
+            ;
             builder.Entity<IdentityRoleClaim<string>>().ToTable("RoleClaims");
             builder.Entity<IdentityUserClaim<string>>().ToTable("UserClaims");

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:43:13
             builder.Entity<IdentityRole<string>>().ToTable("Roles");
             builder.Entity<UserToken>().ToTable("UserTokens");
             builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");
-            builder.Entity<IdentityRoleClaim<string>>().ToTable("RoleClaims");
+            ;
             builder.Entity<IdentityUserClaim<string>>().ToTable("UserClaims");
             builder.Entity<UserLogin>().ToTable("UserLogins");

[NoCoverage] String mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:43:65
             builder.Entity<IdentityRole<string>>().ToTable("Roles");
             builder.Entity<UserToken>().ToTable("UserTokens");
             builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");
-            builder.Entity<IdentityRoleClaim<string>>().ToTable("RoleClaims");
+            builder.Entity<IdentityRoleClaim<string>>().ToTable("");
             builder.Entity<IdentityUserClaim<string>>().ToTable("UserClaims");
             builder.Entity<UserLogin>().ToTable("UserLogins");

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:44:13
             builder.Entity<UserToken>().ToTable("UserTokens");
             builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");
             builder.Entity<IdentityRoleClaim<string>>().ToTable("RoleClaims");
-            builder.Entity<IdentityUserClaim<string>>().ToTable("UserClaims");
+            ;
             builder.Entity<UserLogin>().ToTable("UserLogins");
 

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:45:13
             builder.Entity<IdentityUserRole<string>>().ToTable("UserRoles");
             builder.Entity<IdentityRoleClaim<string>>().ToTable("RoleClaims");
             builder.Entity<IdentityUserClaim<string>>().ToTable("UserClaims");
-            builder.Entity<UserLogin>().ToTable("UserLogins");
+            ;
 
             new UserMapping(builder.Entity<User>());

[NoCoverage] Statement mutation
Infrastructure/Data/DbContext/IdentityDbContext.cs:47:13
             builder.Entity<IdentityUserClaim<string>>().ToTable("UserClaims");
             builder.Entity<UserLogin>().ToTable("UserLogins");
 
-            new UserMapping(builder.Entity<User>());
+            ;
         }
     }
