[NoCoverage] Statement mutation
Infrastructure/Data/EntityMapping/UserMapping.cs:10:13
     {
         public UserMapping(EntityTypeBuilder<User> builder)
         {
-            builder.Property(x => x.Id).ValueGeneratedNever();
+            ;
         }
     }
