[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:78:37
                 columns: table => new
                 {
                     Id = table.Column<int>(type: "int", nullable: false)
-                        .Annotation("SqlServer:Identity", "1, 1"),
+                        .Annotation("", "1, 1"),
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:79:84
                 {
                     Id = table.Column<int>(type: "int", nullable: false)
                         .Annotation("SqlServer:Identity", "1, 1"),
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: true),
                     ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                     ClaimValue = table.Column<string>(type: "nvarchar(max)", nullable: true)

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:80:87
                     Id = table.Column<int>(type: "int", nullable: false)
                         .Annotation("SqlServer:Identity", "1, 1"),
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),
+                    ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     ClaimValue = table.Column<string>(type: "nvarchar(max)", nullable: true)
                 },

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:85:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_UserClaims", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_UserClaims_Users_UserId",

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:86:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_UserClaims", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_UserClaims_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:87:31
                 {
                     table.PrimaryKey("PK_UserClaims", x => x.Id);
                     table.ForeignKey(
-                        name: "FK_UserClaims_Users_UserId",
+                        name: "",
                         column: x => x.UserId,
                         principalTable: "Users",

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:94:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "UserLogins",
-                columns: table => new
-                {
-                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_UserLogins", x => new { x.LoginProvider, x.ProviderKey });
-                    table.ForeignKey(
-                        name: "FK_UserLogins_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:98:91
                 name: "UserLogins",
                 columns: table => new
                 {
-                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: true),
                     ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:99:89
                 columns: table => new
                 {
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: true),
                     ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:100:97
                 {
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
+                    ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: false),
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                 },

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:101:84
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)
+                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:101:57
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)
+                    UserId = table.Column<string>(type: "", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:105:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_UserLogins", x => new { x.LoginProvider, x.ProviderKey });
+                    ;
                     table.ForeignKey(
                         name: "FK_UserLogins_Users_UserId",

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:106:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_UserLogins", x => new { x.LoginProvider, x.ProviderKey });
-                    table.ForeignKey(
-                        name: "FK_UserLogins_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:114:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "UserRoles",
-                columns: table => new
-                {
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_UserRoles", x => new { x.UserId, x.RoleId });
-                    table.ForeignKey(
-                        name: "FK_UserRoles_Roles_RoleId",
-                        column: x => x.RoleId,
-                        principalTable: "Roles",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_UserRoles_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:115:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "UserRoles",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:118:84
                 name: "UserRoles",
                 columns: table => new
                 {
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: true),
                     RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                 },

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:119:84
                 columns: table => new
                 {
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false)
+                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:123:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_UserRoles", x => new { x.UserId, x.RoleId });
+                    ;
                     table.ForeignKey(
                         name: "FK_UserRoles_Roles_RoleId",

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:124:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_UserRoles", x => new { x.UserId, x.RoleId });
-                    table.ForeignKey(
-                        name: "FK_UserRoles_Roles_RoleId",
-                        column: x => x.RoleId,
-                        principalTable: "Roles",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                     table.ForeignKey(
                         name: "FK_UserRoles_Users_UserId",

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:127:41
                     table.ForeignKey(
                         name: "FK_UserRoles_Roles_RoleId",
                         column: x => x.RoleId,
-                        principalTable: "Roles",
+                        principalTable: "",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:130:21
                         principalTable: "Roles",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);
-                    table.ForeignKey(
-                        name: "FK_UserRoles_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:138:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "UserTokens",
-                columns: table => new
-                {
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    Value = table.Column<string>(type: "nvarchar(max)", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_UserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
-                    table.ForeignKey(
-                        name: "FK_UserTokens_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:142:57
                 name: "UserTokens",
                 columns: table => new
                 {
-                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    UserId = table.Column<string>(type: "", nullable: false),
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     Name = table.Column<string>(type: "nvarchar(450)", nullable: false),

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:143:91
                 columns: table => new
                 {
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: true),
                     Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     Value = table.Column<string>(type: "nvarchar(max)", nullable: true)

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:143:64
                 columns: table => new
                 {
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    LoginProvider = table.Column<string>(type: "", nullable: false),
                     Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     Value = table.Column<string>(type: "nvarchar(max)", nullable: true)

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:144:82
                 {
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
+                    Name = table.Column<string>(type: "nvarchar(450)", nullable: true),
                     Value = table.Column<string>(type: "nvarchar(max)", nullable: true)
                 },

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:145:83
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    Value = table.Column<string>(type: "nvarchar(max)", nullable: true)
+                    Value = table.Column<string>(type: "nvarchar(max)", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:145:56
                     UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                     Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
-                    Value = table.Column<string>(type: "nvarchar(max)", nullable: true)
+                    Value = table.Column<string>(type: "", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:149:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_UserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
+                    ;
                     table.ForeignKey(
                         name: "FK_UserTokens_Users_UserId",

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:149:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_UserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
+                    table.PrimaryKey("", x => new { x.UserId, x.LoginProvider, x.Name });
                     table.ForeignKey(
                         name: "FK_UserTokens_Users_UserId",

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:150:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_UserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
-                    table.ForeignKey(
-                        name: "FK_UserTokens_Users_UserId",
-                        column: x => x.UserId,
-                        principalTable: "Users",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:151:31
                 {
                     table.PrimaryKey("PK_UserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
                     table.ForeignKey(
-                        name: "FK_UserTokens_Users_UserId",
+                        name: "",
                         column: x => x.UserId,
                         principalTable: "Users",

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:158:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateIndex(
-                name: "IX_RoleClaims_RoleId",
-                table: "RoleClaims",
-                column: "RoleId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:161:25
             migrationBuilder.CreateIndex(
                 name: "IX_RoleClaims_RoleId",
                 table: "RoleClaims",
-                column: "RoleId");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:163:13
                 table: "RoleClaims",
                 column: "RoleId");
 
-            migrationBuilder.CreateIndex(
-                name: "RoleNameIndex",
-                table: "Roles",
-                column: "NormalizedName",
-                unique: true,
-                filter: "[NormalizedName] IS NOT NULL");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:165:24
 
             migrationBuilder.CreateIndex(
                 name: "RoleNameIndex",
-                table: "Roles",
+                table: "",
                 column: "NormalizedName",
                 unique: true,

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:167:25
                 name: "RoleNameIndex",
                 table: "Roles",
                 column: "NormalizedName",
-                unique: true,
+                unique: false,
                 filter: "[NormalizedName] IS NOT NULL");
 

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:170:13
                 unique: true,
                 filter: "[NormalizedName] IS NOT NULL");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_UserClaims_UserId",
-                table: "UserClaims",
-                column: "UserId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:172:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_UserClaims_UserId",
-                table: "UserClaims",
+                table: "",
                 column: "UserId");
 

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:175:13
                 table: "UserClaims",
                 column: "UserId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_UserLogins_UserId",
-                table: "UserLogins",
-                column: "UserId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:176:23
                 column: "UserId");
 
             migrationBuilder.CreateIndex(
-                name: "IX_UserLogins_UserId",
+                name: "",
                 table: "UserLogins",
                 column: "UserId");

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:180:13
                 table: "UserLogins",
                 column: "UserId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_UserRoles_RoleId",
-                table: "UserRoles",
-                column: "RoleId");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:181:23
                 column: "UserId");
 
             migrationBuilder.CreateIndex(
-                name: "IX_UserRoles_RoleId",
+                name: "",
                 table: "UserRoles",
                 column: "RoleId");

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:182:24
 
             migrationBuilder.CreateIndex(
                 name: "IX_UserRoles_RoleId",
-                table: "UserRoles",
+                table: "",
                 column: "RoleId");
 

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:185:13
                 table: "UserRoles",
                 column: "RoleId");
 
-            migrationBuilder.CreateIndex(
-                name: "EmailIndex",
-                table: "Users",
-                column: "NormalizedEmail");
+            ;
 
             migrationBuilder.CreateIndex(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:187:24
 
             migrationBuilder.CreateIndex(
                 name: "EmailIndex",
-                table: "Users",
+                table: "",
                 column: "NormalizedEmail");
 

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:188:25
             migrationBuilder.CreateIndex(
                 name: "EmailIndex",
                 table: "Users",
-                column: "NormalizedEmail");
+                column: "");
 
             migrationBuilder.CreateIndex(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:190:13
                 table: "Users",
                 column: "NormalizedEmail");
 
-            migrationBuilder.CreateIndex(
-                name: "UserNameIndex",
-                table: "Users",
-                column: "NormalizedUserName",
-                unique: true,
-                filter: "[NormalizedUserName] IS NOT NULL");
+            ;
         }
 

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:193:25
             migrationBuilder.CreateIndex(
                 name: "UserNameIndex",
                 table: "Users",
-                column: "NormalizedUserName",
+                column: "",
                 unique: true,
                 filter: "[NormalizedUserName] IS NOT NULL");

[NoCoverage] Boolean mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:194:25
                 name: "UserNameIndex",
                 table: "Users",
                 column: "NormalizedUserName",
-                unique: true,
+                unique: false,
                 filter: "[NormalizedUserName] IS NOT NULL");
         }

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:200:13
 
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropTable(
-                name: "RoleClaims");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:201:23
         protected override void Down(MigrationBuilder migrationBuilder)
         {
             migrationBuilder.DropTable(
-                name: "RoleClaims");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:203:13
             migrationBuilder.DropTable(
                 name: "RoleClaims");
 
-            migrationBuilder.DropTable(
-                name: "UserClaims");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:206:13
             migrationBuilder.DropTable(
                 name: "UserClaims");
 
-            migrationBuilder.DropTable(
-                name: "UserLogins");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:207:23
                 name: "UserClaims");
 
             migrationBuilder.DropTable(
-                name: "UserLogins");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:209:13
             migrationBuilder.DropTable(
                 name: "UserLogins");
 
-            migrationBuilder.DropTable(
-                name: "UserRoles");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:212:13
             migrationBuilder.DropTable(
                 name: "UserRoles");
 
-            migrationBuilder.DropTable(
-                name: "UserTokens");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
Infrastructure/Data/Migrations/20221005133836_init.cs:215:13
             migrationBuilder.DropTable(
                 name: "UserTokens");
 
-            migrationBuilder.DropTable(
-                name: "Roles");
+            ;
 
             migrationBuilder.DropTable(
