[Killed] Block removal mutation
Identity.Api/UseCases/RegisterUser/RegisterUserRequest.cs:11:9
     {
 
         public RegisterUserRequest(string ownerId, string email, string password)
-        {
-            OwnerId = ownerId;
-            Email = email;
-            Password = password;
-        }
+        {}
 
         [Required(ErrorMessageResourceName = nameof(ContractsMetadata.Required), ErrorMessageResourceType = typeof(ContractsMetadata))]
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_not_registered_if_email_is_duplicated
statusReason: Non-CSharp files in test project were changed
