[Killed] Block removal mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:30:9
         /// 
         /// </summary>
         public RegisterUserUseCase(UserManager<User> userManager, IMessageBus messageBus, IInMemoryBus inMemoryBus, INotificationHandler notifications) : base(messageBus,inMemoryBus)
-        {
-            _userManager = userManager;
-            _notifications = notifications;
-        }
+        {}
 
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_not_registered_if_email_is_duplicated; TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed

[Killed] Equality mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:43:17
         public async Task<CommandResult> Handle(RegisterUserRequest request, CancellationToken cancellationToken)
         {
             var existUser = await _userManager.FindByNameAsync(request.Email);
-            if (existUser != null)
+            if (existUser == null)
                 throw new ApplicationException(ApplicationMessages.UserName_Already_Exist);
 
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_not_registered_if_email_is_duplicated; TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed

[Killed] Statement mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:44:17
         {
             var existUser = await _userManager.FindByNameAsync(request.Email);
             if (existUser != null)
-                throw new ApplicationException(ApplicationMessages.UserName_Already_Exist);
+                ;
 
             var newUser = new User(request.OwnerId)
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_not_registered_if_email_is_duplicated
statusReason: Non-CSharp files in test project were changed

[Killed] Object initializer mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:46:27
             if (existUser != null)
                 throw new ApplicationException(ApplicationMessages.UserName_Already_Exist);
 
-            var newUser = new User(request.OwnerId)
-            {
-                Email = request.Email,
-                UserName = request.Email,
-                IsActive=true
-            };
+            var newUser = new User(request.OwnerId)
+{};
 
             var result = await _userManager.CreateAsync(newUser, request.Password);
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed

[Survived] Boolean mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:50:26
             {
                 Email = request.Email,
                 UserName = request.Email,
-                IsActive=true
+                IsActive=false
             };
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:54:17
             };
 
             var result = await _userManager.CreateAsync(newUser, request.Password);
-            if (!result.Succeeded)
+            if (result.Succeeded)
             {
                 NotifyValidationErrors(result);
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed

[NoCoverage] Statement mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:56:17
             var result = await _userManager.CreateAsync(newUser, request.Password);
             if (!result.Succeeded)
             {
-                NotifyValidationErrors(result);
+                ;
                 throw new ApplicationException(ContractsMessages.Create_Failed);
             }

[NoCoverage] Statement mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:57:17
             if (!result.Succeeded)
             {
                 NotifyValidationErrors(result);
-                throw new ApplicationException(ContractsMessages.Create_Failed);
+                ;
             }
 

[Killed] Statement mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:60:13
                 throw new ApplicationException(ContractsMessages.Create_Failed);
             }
 
-            await PublishDomainEventsAsync(new UserRegisteredEvent(newUser.Id, newUser.Email));
+            ;
            
             await PublishIntegrationEventAsync(new UserRegistered(newUser.Email));
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed

[Killed] Statement mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:62:13
 
             await PublishDomainEventsAsync(new UserRegisteredEvent(newUser.Id, newUser.Email));
            
-            await PublishIntegrationEventAsync(new UserRegistered(newUser.Email));
+            ;
             
             return CommandResult.Create(ContractsMessages.Create_Success, newUser.Id);
killedBy: TaskoMask.Services.Identity.Tests.Unit.UseCases.RegisterUserTests.User_is_registered
statusReason: Non-CSharp files in test project were changed

[NoCoverage] Statement mutation
Identity.Api/UseCases/RegisterUser/RegisterUserUseCase.cs:77:17
             var errors = identityResult.Errors.Select(e => e.Description).ToList();
 
             foreach (var error in errors)
-                _notifications.Add(this.GetType().Name, error);
+                ;
         }
     }
