[NoCoverage] Block removal mutation
Identity.Api/UseCases/UpdateUser/UpdateUserRequest.cs:11:9
     {
 
         public UpdateUserRequest(string oldEmail, string newEmail)
-        {
-            OldEmail = oldEmail;
-            NewEmail = newEmail;
-        }
+        {}
 
 
