[NoCoverage] Block removal mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:30:9
         /// 
         /// </summary>
         public UpdateUserUseCase(UserManager<User> userManager, IMessageBus messageBus, IInMemoryBus inMemoryBus, INotificationHandler notifications) : base(messageBus,inMemoryBus)
-        {
-            _userManager = userManager;
-            _notifications = notifications;
-        }
+        {}
 
 

[NoCoverage] Equality mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:43:17
         public async Task<CommandResult> Handle(UpdateUserRequest request, CancellationToken cancellationToken)
         {
             var user = await _userManager.FindByNameAsync(request.OldEmail);
-            if (user == null)
+            if (user != null)
                 throw new ApplicationException(ContractsMessages.Data_Not_exist, DomainMetadata.User);
 

[NoCoverage] Statement mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:44:17
         {
             var user = await _userManager.FindByNameAsync(request.OldEmail);
             if (user == null)
-                throw new ApplicationException(ContractsMessages.Data_Not_exist, DomainMetadata.User);
+                ;
 
             user.Email = request.NewEmail;

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:50:17
             user.UserName = request.NewEmail;
 
             var result = await _userManager.UpdateAsync(user);
-            if (!result.Succeeded)
+            if (result.Succeeded)
             {
                 NotifyValidationErrors(result);

[NoCoverage] Statement mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:53:17
             if (!result.Succeeded)
             {
                 NotifyValidationErrors(result);
-                throw new ApplicationException(ContractsMessages.Update_Failed);
+                ;
             }
           

[NoCoverage] Statement mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:56:13
                 throw new ApplicationException(ContractsMessages.Update_Failed);
             }
           
-            await PublishDomainEventsAsync(new UserUpdatedEvent(user.Id, user.Email));
+            ;
            
             await PublishIntegrationEventAsync(new UserUpdated(user.Email));

[NoCoverage] Statement mutation
Identity.Api/UseCases/UpdateUser/UpdateUserUseCase.cs:58:13
           
             await PublishDomainEventsAsync(new UserUpdatedEvent(user.Id, user.Email));
            
-            await PublishIntegrationEventAsync(new UserUpdated(user.Email));
+            ;
             
             return CommandResult.Create(ContractsMessages.Update_Success, user.Id);
